import React, { useState } from 'react';
import LeftHomePage from '../mainHomePage/LeftHomePage';

const CivilService = () => {
    const [serviceData, setServiceData] = useState([
        {
            id: 1,
            details: "১। বাংলাদেশ পুলিশ জনগণের সেবা প্রদানকারী একটি প্রতিষ্ঠান।",
        },
        {
            id: 2,
            details: "২। জাতী, ধর্ম, বর্ণ ও রাজনৈতিক/সামাজিক/অর্থনৈতিক শ্রেণি নির্বিশেষে দেশের প্রতিটি থানায় সলক নাগরিকের সমান আইনগত অধিকার লাভের সুযোগ রয়েছে।",
        },
        {
            id: 3,
            details: "৩। থানায় আগত সাহায্য প্রার্থীদের আগে আসা ব্যক্তিকে আগে সেবা প্রদান করা হবে।",
        },
        {
            id: 4,
            details: "৪। থানায় সাহায্যপ্রার্থী সকল ব্যক্তিতে থানা পুলিশ সম্মান প্রদর্শন করবে এবং সম্মান সম্বোধন করবে।",
        },
        {
            id: 5,
            details: "৫। থানায় জিডি করতে আসা ব্যক্তির আবেদনকৃত বিষয়ে ডিউটি অফিসার সর্বাত্মক সহযোগীতা প্রদান করবে এবং আবেদনের দ্বিতীয় কপিতে জিডি নম্বর, তারিখ এবং সংশ্লিষ্ট অফিসারের স্বাক্ষর ও সীলমোহরসহ তা আবেদনকারীকে প্রদান করতে হবে। বর্ণিত জিডি সংক্রান্ত বিষয়ে যথাশীঘ্র সম্ভব ব্যবস্থা গ্রহণ করা হবে এবং গৃহীত ব্যবস্থা পুনরায় আবেদনকারীকে অবহিত করা হবে।",
        },
        {
            id: 6,
            details: "৬। থানায় মামলা করতে আসা ব্যক্তির মৌখিক / লিখিত বক্তব্য ভারপ্রাপ্ত কর্মকর্তা কর্তৃক এজাহারভূক্ত করবে এবং আগত ব্যক্তিকে মামমলার নম্বর, তারিখ ধারা এবং তদন্তকারী অফিসারের নাম ও পদবী অবহিত করবে। তদন্তকারী অফিসার এজাহারকারীরর সাথে নিয়মিত যোগাযোগ রক্ষা করে তাকে তদন্তের অগ্রগতি সম্পর্কে অবহিত করবে এবং তদন্ত সমাপ্ত হলে তাকে ফলাফল লিখিতভাবে জানিয়ে দিবে।",
        },
        {
            id: 7,
            details: "৭। থানায় মামলা করতে আসা কোন ব্যক্তির মামলা ভারপ্রাপ্ত কর্মকর্তা / থানার ডিউটি অফিসার এন্ট্রি করতে অপারগতা প্রকাশ করলে তখন উক্ত বিষয়টির উপর প্রতিকার চেয়ে নিম্নবর্ণিত নিয়মানুযায়ী আবেদন করবেনঃ -",
            subdetails: [
                {
                    id: 1,
                    txt: "ক.মেট্রোপলিটন এলাকার সহকারী পুলিশ কমিশনার(জোন) / জেলায় সহকারী পুলিশ সুপার(সার্কেল) এর নিকট আবেদন করবেন।",
                },
                {
                    id: 1,
                    txt: "খ.তিনি যদি উক্ত বিষয়ে ব্যবস্থা গ্রহণ না করেন তা হলে উক্ত ব্যক্তি ডিপুটি পুলিশ কমিশনার / জেলা পুলিশ সুপারের নিকট আবেদন করবেন।",
                },
                {
                    id: 1,
                    txt: "গ.অতঃপর তিনও যদি উক্ত ব্যক্তির বিষয়ে কোন ব্যবস্থা গ্রহণ না করেন তা হলে উক্ত ব্যক্তি সংশ্লিষ্ট পুলিশ কমিশনার / ডিআইজি’র নিকট আবেদন করবেন।",
                },
                {
                    id: 1,
                    txt: "ঘ. তারা কেউ উক্ত বিষয়ে কোন ব্যবস্থা গ্রহণ না করলে মহা পুলিশ পরিদর্শকের নিকট উক্ত বিষয়ে প্রতিকার চেয়ে আবেদন করবেন।",
                },
            ],
        },

        {
            id: 8,
            details: "৮। আহত ভিকটিমকে থানা হতে সার্বিক সহযোগীতা প্রদান করা হবে এবং এ বিষয়ে থানার সকল মেডিক্যাল সার্টিফিকেট সংগ্রহ করবে।",
        },
        {
            id: 9,
            details: "৯। শিশু / কিশোর অপরাধী সংক্রান্ত বিষয়ে শিশুআইন, ১৯৭৪ এর বিধান অনুসরণ করা হবে এবং তারা যাতে কোনভাবেই বয়স্ক অপরাধীর সংস্পর্শে না আসতে পারে। তা নিশ্চিত করা হবে। এ জন্য দেশের সকল থানায় পর্যায়ক্রমে কিশোর হাজতখানা ব্যবস্থা করা হবে।",
        },
        {
            id: 10,
            details: "১০। মহিলা আসামমী / ভিকটিমকে যথাসম্ভব মহিলা পুলিশের মাধ্যেমে সার্বিক নিরাপত্তা নিশ্চিত করবেন।",
        },
        {
            id: 11,
            details: "১১। দেশের কিছু সংখ্যক থানায় ওয়ানস্টপ সার্বিস ডেলিভারী সেন্টার চালূ করা হয়েছে। পর্যায়ক্রমে উক্ত ওয়ানস্টপ সার্ভিস ডেলিভারী সেন্টার দেশের সকল থানায় প্রবর্তন করা হবে।",
        },
        {
            id: 12,
            details: "১২। আহত / মানসিকভাবে বিপর্যাস্ত ভিকটিমকে সার্বিক সহযোগীতার জন্য দেশের সকল থানায় পর্যায়ক্রমে ভিকটিম সাপোর্ট ইউনিট চালুকরা হবে।",
        },
        {
            id: 13,
            details: "১৩। পাসপোর্ট / ভেরিফিকেশন / আগ্নেয়াস্ত্রের লাইসেন্স ইত্যাদি বিষয়ে সকল অনুসন্ধান প্রাপ্তির ৩ (তিন) দিনের মধ্যে তদন্ত সম্পন্ন করে থানা হতে সংশ্লিষ্ট ইউনিটে প্রতিবেদন প্রেরণ করা হবে।",
        },
        {
            id: 14,
            details: "১৪। থানা হতে বর্ণিত আইনগত সহযোগিতা না পাওয়া গেলে বা কোন পুলিশ সদস্যের বিরুদ্ধে কোন অভিযোগ থাকলে উর্ধ্বতন কর্তৃপক্ষ বরাবর অভিযোগ দাখিল করা যাবে। সেইক্ষেত্রে উর্ধ্বতন কর্তৃপক্ষঃ",
            subdetails: [
                {
                    id: 1,
                    txt: "ক.লিখিত অভিযোগ প্রাপ্তির ১৫ (পনেরো) দিনের মধ্যে কার্যাকর আইনগত ব্যবস্থা গ্রহণ করবেন এবং তা অবিযোগকারীকে অবহিত করবেন।",
                },
                {
                    id: 2,
                    txt: "খ.ব্যক্তিগতভাবে হাজির হওয়া ব্যক্তির বক্তব্য মনোযোগ সহকারে শুনবেন, প্রয়োজনীয় ব্যবস্থা গ্রহণ করবেন এবং তা অবিযোগকারীকে জানাবেন।",
                },
                {
                    id: 3,
                    txt: "গ.টেলিফোনে প্রাপ্ত সংবাদের ভিত্তিতে প্রয়োজনীয় ব্যবস্থা গ্রহণ করবেন।",
                },
            ],
        },

        {
            id: 15,
            details: "১৫। সকল থানায় মেট্রোপলিটন এলাকার জন্য কমিশনার, অতিরিক্ত কমিশনার, সংশ্লিষ্ট জয়েন্ট কমিশনার, ডিসি, এডিসি এবং জোনাল এসি এবং জেলার জন্য পুলিশ সুপার, অতিরিক্ত পুলিশ সুপার, এএসপি(হেডকোয়ার্টার্স), সংশ্লিষ্ট সার্কেল এএসপি এবং থানার ভারপ্রাপ্ত কর্মকর্তা টেলিফোন নম্বর প্রকাশ্য স্থানে প্রদর্শিত হবে।",
        },

        {
            id: 16,
            details: "১৬। মেট্রো পলিটন ও জেলায় কর্তব্যরত সকল পর্যায়ের অফিসারগণ প্রতি কারযদিবসে নির্ধারিত সময়ে সকল সাহায্যপ্রার্থীকে সাহায্য প্রদান করবে।",
        },

        {
            id: 17,
            details: "১৭। থানার পুলিশ সদস্যগণ কমিউনিটি সাথে নিরবিচ্ছিন্ন যোগাযোগ রক্ষা করবেন এবং কম্যুনিটি ওরিয়েন্টেড পুলিশ সার্ভিস চালু করবেন।",
        },

        {
            id: 18,
            details: "১৮। উর্দ্ধতন পুলিশ কর্মকর্তাগণ নিয়মিত কম্যুনিটির সহিত অপরাধ দমনমূলক / জনসংযোগমূলক সভা করবেন এবং সামাজিক সমস্যাসমূহের আইনগত সমাধানের প্রয়াস চালাবেন।",
        },

        {
            id: 19,
            details: "১৯। বিদেশে চাকুরী / উচ্চ শিক্ষার জন্য গমনেচ্ছু প্রার্থীদের পুলিশ ক্লিয়ারেন্স সার্টিফিকেট প্রদান করবেন।",
        },

        {
            id: 20,
            details: "২০। ব্যাংক হতে কোন প্রতিষ্ঠান অধিক পরিমাণ টাকা উত্তোলন করলে উক্ত টাকা নিরাপদে নেওয়ার জন্য চাহিদা অনুযায়ী পুীলশ এস্কর্টের ব্যবস্থা করা হবে।",
        },

        {
            id: 21,
            details: "২১। মেট্রোপলিটন শহর / জেলা শহরে যানবাহন নিয়ন্ত্রণে ট্রাফিক বিভাগ, ট্রাফিক সংশ্লিষ্ট কি কি সেবা প্রদান করছে তা প্রকাশ্য স্থানে প্রদর্শিত হবে।",
        },
    ])



    return (
        <div className="container py-3">
            <div className="row g-3">
                <div className="col-md-9">
                    <div className="geo__familarity">
                        <h6 className="geo__familarity__title">নাগরিক সেবা</h6>
                    </div>
                    <div className="pt-2">
                        <ul className="list-unstyled">
                            {
                                serviceData !== undefined && serviceData.map((item, index) => {
                                    return (
                                        <li key={index}>
                                            <p className="geo__familarity__desc">{item.details}</p>
                                            <ul className="list-unstyled">
                                                {item.subdetails!==undefined && item.subdetails.map((item, index) => {
                                                    return (
                                                        <li key={index}>
                                                            <p className="geo__familarity__desc">{item.txt}</p>
                                                        </li>
                                                    )
                                                })}
                                            </ul>
                                        </li>
                                    )
                                })
                            }
                        </ul>
                    </div>
                </div>
                <div className="col-md-3">
                    <LeftHomePage />
                </div>
            </div>

        </div>
    );
};

export default CivilService;