import React, { useState } from 'react';
import LeftHomePage from '../mainHomePage/LeftHomePage';

const SightseeingPlacesDistrict = () => {

    const [sightseeingPlaceData, setSightseeingPlaceData] = useState([
        {
            id: 1,
            title_name: "জঙ্গলবাড়ি র্দূগ",
            desc: "জঙ্গলবাড়ি র্দুগ ছলি বার ভূঁইয়াদরে প্রধান ঈসা খাঁর দ্বতিীয় রাজধানী। এটি কশিোরগঞ্জ শহর থকেে ৬ কলিোমটিার দূরে করমিগঞ্জ উপজলোর কাদরিজঙ্গল ইউনযি়নরে জঙ্গলবাড়ি গ্রামে অবস্থতি। র্দুগরে ভতিরে ঈসা খাঁ কয়কেটি স্থাপনা গড়ে তোলনে। ১৮৯৭ সালে ভুমকিম্পে র্দুগরে কছিু অংশ ক্ষতগ্রিস্থ হয়।",
        },
        {
            id: 2,
            title_name: "এগারসন্দিুর র্দূগ",
            desc: "এগারসন্দিুর র্দুগ পাকুন্দযি়া উপজলোর এগারসন্দিুর গ্রামে অবস্থতি। গ্রামটি ব্রহ্মপুত্র নদীর র্পূব তীরে অবস্থতি। ইতহিাসবত্তো আবুল ফজল রচতি আকবরনামা গ্রন্থে এই গ্রামরে নাম উল্লখে রয়ছে।ে এটি ছলি অহম শাসকদরে রাজধানী। ১৫৩৮ সালে মুঘলরা অহমদরে পরাজতি করে এ অঞ্চল দখল কর।ে এখানইে ১৫৮০ সালে বার ভূঁইয়াদরে প্রধান ঈসা খাঁ মুঘল সম্রাট আকবররে সনোপতি মান সংিহকে পরাজতি কর।",
        },
        {
            id: 3,
            title_name: "শোলাকিয়া ঈদগাহ ময়দান",
            desc: "কশিোরগঞ্জ সদর উপজলোর র্পূব প্রান্তে প্রায় ৬.৬১ একর জমতিে অবস্থতি বাংলাদশে তথা উপমহাদশেরে র্সববৃহৎ ও ঐতহ্যিবাহী শোলাকযি়া ঈদগাহ ময়দান। প্রতবিছর এ ময়দানে ঈদ-উল-ফতির ও ঈদ-উল-আযহার নামাজরে জামাত অনুষ্ঠতি হয়। কালরে স্রোতে শোলাকযি়া ঈদগাহ ময়দানটি পরণিত হয়ে উঠছেে একটি ঐতহিাসকি স্থান।ে ইসলামরে ঐশী বাণী প্রচাররে জন্য সুদূর ইয়মেনে থকেে আগত শোলাকযি়া 'সাহবে বাড়রি' র্পূবপুরুষ সুফি সযৈ়দ আহমদে তার নজিস্ব তালুকে ১৮২৮ সালে নরসুন্দা নদীর তীরে ঈদরে জামাতরে আয়োজন করনে।[৩][৪][৫] ওই জামাতে ইমামতি করনে সুফি সযৈ়দ আহমদে নজিইে। অনকেরে মত,ে মোনাজাতে তনিি মুসল্লদিরে প্রার্চুযতা প্রকাশে 'সোয়া লাখ' কথাটি ব্যবহার করনে। আরকে মত,ে সদেনিরে জামাতে ১ লাখ ২৫ হাজার (র্অথাৎ সোয়া লাখ) লোক জমায়তে হয়। ফলে এর নাম হয় 'সোয়া লাখ'ি । পরর্বতীতে উচ্চারণরে বর্বিতনে শোলাকযি়া নামটি চালু হয়ে যায়।[৪] আবার কউে কউে বলনে, মোগল আমলে এখানে অবস্থতি পরগনার রাজস্বরে পরমিাণ ছলি সোয়া লাখ টাকা। উচ্চারণরে বর্বিতনে সোয়া লাখ থকেে সোয়ালাখযি়া, সখোন থকেে শোলাকযি়া। পরর্বততিে ১৯৫০ সালে স্থানীয় দওেয়ান মান্নান দাদ খাঁ এই ময়দানকে অতরিক্তি ৪.৩৫ একর জমি দান করনে।[৬]",
        },
        {
            id: 4,
            title_name: "শহীদী মসজদি",
            desc: "কশিোরগঞ্জ জলো শহরে অবস্থতি আধুনকি স্থাপত্যরে এক ঐতহিাসকি নর্দিশন “শহীদী মসজদি”। এ মসজদিটি এ অঞ্চলরে ইতহিাসরে এক বরিল নর্দিশন। মসজদিটরি নাম ‘শহীদী মসজদি” এ নামকরণ নযি়ে সাধারণ মানুষরে মনে কৌতূহলরে অন্ত নইে। মূল শহররে প্রাণকন্দ্রেে মসজদিটরি অবস্থান। শহীদী মসজদিরে ইতহিাস খুব পুরনো না হলওে এটি অত্যন্ত আর্কষণীয়। মসজদিটকিে আধুনকিরূপে নর্মিাণরে ক্ষত্রেে যনিি অসাধারণ ভূমকিা রখেছেনে তনিি হলনে হযরত মাওলানা আতাহার আলী (রহঃ)।মাওলানা আতাহার আলী পুরান থানার এ মসজদিে আসনে ১৯৩৮ সাল।ে মসজদিরে নর্মিাণ সমাপ্তরি পর তনিি ১৩৬৪ বাংলা সনরে ৮ই র্কাতকি মসজদিরে দক্ষণি-র্পূব কোণে এক অভূতর্পূব বশিাল সুউচ্চ পাঁচতলা মনিাররে ভত্তিি স্থাপন করনে।এরপরই মসজদিটি ঐতহিাসকি মসজদিে রূপান্তরতি হয় এবং নামকরণ করা হয় “শহীদী মসজদি” নাম।",
        },
        {
            id: 5,
            title_name: "চন্দ্রাবতী মন্দরি",
            desc: "চন্দ্রাবতীর শবিমন্দরি ষোড়শ শতাব্দীতে নর্মিতি প্রথম বাঙালি মহলিা কবি স্মৃতবিজিরতি শবিমন্দরি। এটি কশিোরগঞ্জ শহর থকেে ৬ কলিোমটিার দূরে মাইজখাপন ইউনযি়নরে কাচারীপাড়া গ্রামে ফুলশ্বেরী নদীর তীরে অবস্থতি।",
        },
        {
            id: 6,
            title_name: "দিল্লীর আখড়া",
            desc: "দল্লিীর আখড়া মুঘল সম্রাট জাহাঙ্গীররে শাসনামলে নর্মিতি। এটি মঠিামইন উপজলোয় অবস্থতি।",
        },
        {
            id: 7,
            title_name: "মানব বাবুর বাড়ি",
            desc: "মানব বাবুর বাড়ি হোসনেপুর উপজলোর গোবন্দিপুর ইউনযি়নরে গাঙ্গাটযি়া গ্রামে অবস্থতি। ১৯০৪ সালে জমদিাররি পত্তন হলে ব্রটিশি জপেি ওয়াইজরে কাছ থকেে জমদিারি কনিে ননে গাঙ্গাটযি়ার ভূপতনিাথ চক্রর্বতী। সখোনইে তনিি এই বাড়টিি নর্মিাণ করনে।",
        },
        {
            id: 8,
            title_name: "সৈয়দ নজরুল ইসলাম সেতু",
            desc: "সড়কপথে ভরৈব ও আশুগঞ্জরে মধ্যে অবাধ যোগাযোগরে জন্য মঘেনা নদীর উপর নর্মিতি নান্দ্যনকি এক সতেুর নাম সযৈ়দ নজরুল ইসলাম সতেু (ঝধুবফ ঘধুৎঁষ ওংষধস ইৎরফমব)। ১৯৯৯ সালে সতেুটরি নর্মিাণ কাজ শুরু হয়ে ২০০২ সালে শষে হয়। ঢাকা-সলিটে মহাসড়কে অবস্থতি ১.২ কলিোমটিার দর্ঘ্যৈ এবং ১৯.৬০ মটিার প্রস্থ বশিষ্টি এই সতেুটতিে ৭টি ১১০ মটিার স্প্যান এবং ২টি ৭৯.৫ মটিার স্প্যান রয়ছে।ে সযৈ়দ নজরুল ইসলাম সতেুর র্পূব নাম ছলি বাংলাদশে-যুক্তরাজ্য মত্রৈী সতেু, যা ২০১০ সালে পরর্বিতন করা হয়। যদওি স্থানীয়দরে কাছে সতেুটি ভরৈব ব্রজি নামে অধকি পরচিতি। সতেুতে দাঁড়যি়ে মঘেনা নদীর সৌর্ন্দয অবলোকনরে পাশাপাশি বভিন্নি নৌযান ও জলেদেরে র্কমব্যস্ততা প্রত্যক্ষ করা যায়। সযৈ়দ নজরুল ইসলাম সতেু বা ভরৈব ব্রীজরে ঠকি পাশইে রয়ছেে ১৯৩৭ সালে নর্মিতি রাজা ৬ষ্ঠ র্জজ রলে সতেু, যার অন্য নাম হাবলিদার আব্দুল হালমি রলেসতেু। র্বতমানে র্জজ রলে সতেুর পাশে আরো একটি নতুন রলে সতেু নর্মিাণ করা হয়ছে।ে সযৈ়দ নজরুল ইসলাম সতেুর নচিে মঘেনা নদীর তীরে প্রতদিনি বপিুল সংখ্যক র্দশর্নাথীদরে আগমণ ঘট।ে নদী তীরকে তাই নানান প্রাকৃতকি উপকরণে সাজানো হয়ছে।ে ফলে প্রাকৃতকি পরবিশেে মুক্ত হাওয়ায় সময় কাটানোর জন্য সযৈ়দ নজরুল ইসলাম সতেু বপিুল জনপ্রযি় এক স্থানে পরণিত হয়ছে।ে এছাড়া সন্ধ্যার পর যখন সতেুর সমস্ত বাতগিুলো জ্বলে উঠে তখন নদীর তীর থকেে সতেুটকিে দখেতে সবচযে়ে সুন্দর লাগ।",
        },
        {
            id: 9,
            title_name: "তালজাঙ্গা জমদিার বাড়ি",
            desc: "তালজাঙ্গা জমদিার বাড়ি কশিোরগঞ্জ জলোর তাড়াইল উপজলোর এক ঐতহিাসকি জমদিার বাড়।ি তালজাঙ্গা জমদিার বাড়টিি প্রায় একশত বৎসর আগে জমদিার বাড়ি হসিবেে প্রতষ্ঠিতি হয়। জমদিার বাড়টিরি প্রতষ্ঠিাতা ছলিনে জমদিার রাজ চন্দ্র রায়। যনিি ছলিনে শক্ষিতি জমদিার, তখনকার সময়রে এম.এ.ব.িএল ডগ্রিীপ্রাপ্ত উকলি ছলিনে। তনিি ১৯১৪ সালে জমদিারি প্রতষ্ঠিা করার পর প্রায় ৩৩ বছর র্পযন্ত র্অথাৎ ১৯৪৭ সাল র্পযন্ত জমদিারি করনে। তার জমদিারি শষে হয় তার মৃত্যুর মধ্য দযি়।ে তারপর এই জমদিার বাড়রি জমদিার হন তার ছলেে মহমি চন্দ্র রায়। মহমি চন্দ্র রায়ও বাবার মত ছলিনে শক্ষিতি এবং এম.এ.ব.িএল ডগ্রিীপ্রাপ্ত একজন উকলি। তনিি কলকাতা থকেে ডগ্রিী নওেয়ার পর ময়মনসংিহ জজ র্কোটে আইন ব্যবসা শুরু করনে এবং সখোনকার সভাপতওি ছলিনে।",
        },
        {
            id: 10,
            title_name: "নিকলীর বেড়িবাধঁ",
            desc: "দ্বগিন্ত বস্তিৃত জলরাশরি বুকে নৌকায় ঘুরে বডে়ানোর আনন্দ পতেে চাইলে চলে যান নকিলী হাওরে (ঘরশষর ঐধড়ৎ)। নকিলী হাওর কশিোরগঞ্জ জলোর নকিলী উপজলোয় অবস্থতি। কশিোরগঞ্জ সদর থকেে নকিলি উপজলোর দূরত্ব প্রায় ২৫ কলিোমটিার। পানতিে দ্বীপরে মত ভসেে থাকা ছোট ছোট গ্রাম, স্বচ্ছ জলরে খলো, মাছ ধরতে জলেদেরে ব্যস্ততা, রাতারগুলরে মত ছোট জলাবন ও খাওয়ার জন্যে হাওররে তরতাজা নানা মাছ। এই সব কছিুর অভজ্ঞিতা পতেে চাইলে নকিলীর অপরূপ হাওর ভ্রমণ আপনার জীবনে মনে রাখার মত একটি ভ্রমণ হসিবেে গঁেথে থাকব।ে আর ঢাকা থকেে একদনিইে ঘুরে আসা সম্ভব নকিলী হাওর থকে।ে সম্প্রতি বাংলাদশে সরকার এটকিে টুরস্টিস্পট হসিবেে ঘোষণা দযি়ছে।",
        },
    ]);

    return (
        <div className="container py-3">
            <div className="row g-3">
                <div className="col-md-9">
                    <div className="geo__familarity">
                        <h6 className="geo__familarity__title">জেলার দর্শনীয় স্থানসমূহ</h6>
                    </div>
                    <div className="pt-2">
                        <ul className="list-unstyled">
                            {sightseeingPlaceData!==undefined && sightseeingPlaceData.map((item, index) => (
                                <li key={index}>
                                    <h6 className="pt-3 fw-bold">{item.title_name}</h6>
                                    <p className="geo__familarity__desc">{item.desc}</p>
                                </li>
                            ))}

                        </ul>
                    </div>
                </div>
                <div className="col-md-3">
                    <LeftHomePage />
                </div>
            </div>
        </div>
    );
};

export default SightseeingPlacesDistrict;