import { useEffect, useState } from 'react';
import { Link } from 'react-router-dom';
import axios from 'axios';
import imgUrl from '../../imgUrl';
import "./RecentActivitiesPage.css"


const RecentActivities = () => {
    const [recentActivityData, setRecentActivityData] = useState([
        // {
        //     id: 1,
        //     image: RA_img,
        //     title: "কিশোরগঞ্জের বাজিতপুরে ১০১১ পিস ইয়াবাসহ দুই মাদক ব্যবসায়ী গ্রেফতার",
        //     desc: "ইংরেজি ০৬-০৫-২০২৩ তারিখ রাত্রি ২১.৪৫ ঘটিকায় ১০১১ (এক হাজার এগারো) পিস ইয়াবা ট্যাবলেটসহ বাজিতপুর থানাধীন বাহেরবালী খেয়া নৌকা ঘাটে অভিযান পরিচালনা করে বিবাদী ১। জামান মিয়াজি (২৫), পিতা- ইব্রাহিম মিয়াজি, মাতা- আসিয়া খাতুন, ২। মাকসুদুল হাসান @ মাসুম (২৫), পিতা- আক্কেল আলী, মাতা- পারভীন বেগম, উভয় সাং- পুরাকান্দা (মাইজচর), থানা- বাজিতপুর, জেলা- কিশোরগঞ্জদ্বয়কে বাজিতপুর থানা পুলিশ গ্রেফতার করেন। ইংরেজি ০৬-০৫-২০২৩ তারিখ রাত্রি ২০.৩৫ ঘটিকায় কিশোরগঞ্জের বাজিতপুর থানা কর্তৃক মাদকদ্রব্য উদ্ধার অভিযান কালে এসআই (নিরস্ত্র) সজীব সাহা অভিজিৎ গোপন সংবাদের ভিত্তিতে সঙ্গীয় অফিসার-ফোর্সের সহায়তায় উক্ত বিবাদীদ্বয়কে গ্রেফতার করে বিবাদীদ্বয়ের নিজ হাতে বের করে দেওয়া ১০১১ (এক হাজার এগারো) পিস ইয়াবা ট্যাবলেট উদ্ধারপূর্বক রাত্রি ২১.৪৫ ঘটিকায় জব্দ তালিকা মূলে জব্দ করেন। এ ঘটনায় বাজিতপুর থানায় মাদকদ্রব্য নিয়ন্ত্রণ আইন, ২০১৮-এ একটি নিয়মিত মামলা রুজু করা হয়েছে।",
        // },
        // {
        //     id: 2,
        //     image: RA_img3,
        //     title: "কিশোরগঞ্জ ডিবি পুলিশ কর্তৃক ৫কেজি গাঁজাসহ ০৪ জন গ্রেফতার",
        //     desc: "নিজস্ব প্রতিনিধি : জেলা গোয়েন্দা শাখার (ডিবি) এসআই(নিঃ) মোঃ রমজান আলী গোপন সংবাদের ভিত্তিতে সঙ্গীয় অফিসার-ফোর্সের সহায়তায় ১৬ ফেব্রুয়ারী সন্ধ্যা ৭টায় কিশোরগঞ্জ সদর থানার উত্তর নান্দলা গ্রামের ইসমাইল (৬০), পিতা মৃত- উসুমদ্দিন বাড়ির সামনে উঠানে অভিযান পরিচালনা করে জুয়েল মিয়া(২৬), পিতা-মোঃ চান মিয়া, জাকির হোসেন (২৪), পিতা-মোঃ লোকমান মিয়া, উভয় সাং- কালিপুর,ইসমাইল(৬০), পিতা মৃত উসুমদ্দিন, সাং-উত্তর নান্দলা, সর্ব থানা-ভৈরব, জেলা- কিশোরগঞ্জদের গ্রেফতার করে এবং আসামিদের কাছে থাকা ৪ কেজি গাঁজা উদ্ধার করে।",
        // },
        // {
        //     id: 3,
        //     image: RA_img2,
        //     title: "কিশোরগঞ্জ ডিবি পুলিশ কর্তৃক ৫কেজি গাঁজাসহ ০৪ জন গ্রেফতার",
        //     desc: "অপরদিকে একই অফিসার ঐ দিন রাত ৯.৫০ টায় কিশোরগঞ্জ সদর থানাধীন কড়িয়াল গ্রামের নতুন বাজারস্থ মোঃ আলম উদ্দিন (৫০), পিতা মৃত হাফিজ উদ্দিন এর একচালা টিনের ছাপটা বিশিষ্ট বন্ধ দোকানের সামনে পাকা রাস্তার উপর অভিযান পরিচালনা করে আসামি মোঃ মিলন (৩০) পিতামৃত-ছাদেক মিয়া সাং-বগাডুবি, থানা ও জেলা- কিশোরগঞ্জকে গ্রেফতার করে এবং তার কাছে থাকা ১কেজি গাঁজা। এ ব্যাপারে দুটি ঘটনায় কিশোরগঞ্জ মডেল থানায় পৃথক পৃথক  মামলা দায়ের করা হয়েছে।",
        // },
        // {
        //     id: 4,
        //     image: RA_img4,
        //     title: "কিশোরগঞ্জে ৩,০০০(তিন হাজার) পিছ ইয়াবাসহ আটক ১",
        //     desc: "কিশোরগঞ্জের ভৈরব হতে ৩ হাজার পিছ ইয়াবা ট্যাবলেটসহ আরিফ হাসান নামের একজনকে আটক করেছে কিশোরগঞ্জ গোয়েন্দা পুলিশ (ডিবি)। গত ৫ নভেম্বর কিশোরগঞ্জ জেলার ভৈরব থানাধীন ভৈরবপুর এলাকার জজ নিয়ার ছেলে আরিফ হাসান (৩১) কে ৩ হাজার পিছ ইয়াবা ট্যাবলেট ও নগদ নয় হাজার ছয় শত বিশ টাকাসহ আটক করা হয়। মামলার এজাহারে জানা যায়, জেলার গোয়েন্দা শাখা (ডিবি)র একটি দল গোপন সংবাদের ভিত্তিতে ৫ নভেম্বর রাত প্রায় নয়টার সময় জেলার ভৈরব থানাধীন দক্ষিণপাড়া এলাকার আরিফ হাসানের বসতবাড়ীতে অভিযান চালায় গোয়েন্দা পুলিশ ডিবি। পরে আরিফের বিছানা নিচ থেকে তিন হাজার পিছ ইয়াবা ট্যাবলেট ও নগদ ৯ হাজার ৬ শত ২০ টাকা উদ্ধার করে। উদ্ধারের পর গোয়েন্দা শাখার  উপ পরিদর্শক মোঃ জুয়েল রানা বাদী হয়ে একটি মাদক মামলা রুজু করেন। উল্লেখ্য, ভৈরব থানায় আরিফ হাসানের নামে ২০১৬ সালে ১৭ ডিসেম্বর ১৯(১)এর ৩(ক)/২৫.১৯৯০ সালের মাদক নিয়ন্ত্রণ আইনে একটি মামলা হয়।",
        // },
        // {
        //     id: 5,
        //     image: RA_img6,
        //     title: "কিশোরগঞ্জে ডাকাতি মামলায় ৭ জন গ্রেপ্তার।",
        //     desc: "কিশোরগঞ্জের কটিয়াদী থানায় গত ২৫ অক্টোবর মধ্য রাতে ডাকাতির ঘটনায় জড়িত ৫ জনকে গ্রেফতার ও ৭ জনের বিরুদ্ধে মামলার বিষয়ে সংবাদ সম্মেলন করেন পুলিশ সুপার মোহাম্মদ রাসেল শেখ পিপিএম (বার)। বুধবার (০২ নভেম্বর) সকাল ১১টায় পুলিশ সুপারের সম্মেলন কক্ষে এক সংবাদ সম্মেলনে পুলিশ সুপার জানান, ঘটনার পরের দিনই এজাহারভুক্ত আসামি সাদ্দাম (২২) ও মাহফুজ (২০) কে গ্রেফতার করা হয়। পরবর্তীতে তদন্ত সাপেক্ষে ঘটনার সাথে জড়িত থাকায় গাজীপুর চৌরাস্তা থেকে ৩ জন, কটিয়াদী থেকে ১ জন, পাকুন্দিয়া থেকে ১ জনসহ মোট ৫ জনকে গ্রেফতার করা হয়। গ্রেফতারকৃত হলো- কটিয়াদী উপজেলার পাইকসা গ্রামের মৃত ফয়েজ উদ্দিনের পুত্র রিয়াজ উদ্দিন (৫০) ও একই গ্রামের মোহাম্মদ আলী, একই উপজেলা সাটিয়াদী গ্রামের আব্দুল খালেকের পুত্র বাচ্চু (৪০), আঃ কাদিরের পুত্র সুলতান (২৮), পাকুন্দিয়া উপজেলার তালদশি গ্রামের হরিপদ সাহার পুত্র বাপন সাহা (৩৫)। গ্রেফতারকৃত আসামিদের বর্ণনা অনুযায়ী আসামি বাপন সাহার দোকান থেকে এক জোড়া স্বর্ণের দুল, দুইটি স্বর্ণের বালা, একটি স্বর্ণের চেইন, তিনটি স্বর্ণের আংটি ও স্বর্ণ বিক্রির নগদ ১ লাখ ৬৫ হাজার টাকা উদ্ধার করা হয়েছে। ডাকাতির সাথে জড়িত অন্যান্য ব্যক্তিদেরকে গ্রেফতারে অভিযান অব্যাহত আছে। সংবাদ সম্মেলনে উপস্থিত ছিলেন, অতিরিক্ত পুলিশ সুপার (প্রশাসন) মোস্তাক সরকার, অতিরিক্ত পুলিশ সুপার (অপরাধ) নূরে আলম, হোসেনপুর সার্কেলের অতিরিক্ত পুলিশ সুপার সুজন চন্দ্র সরকার, কটিয়াদী থানার ওসি (তদন্ত) কাজী মাহফুজ হাসান সিদ্দিকী ও মামলার তদন্তকারী এস.আই দুলাল মিয়া প্রমুখ। যাযাদি/সাইফুল",
        // },
        // {
        //     id: 6,
        //     image: RA_img5,
        //     title: "আপন চাচাতো ভাই রাহাত হত‌্যা মামলার প্রধান আসামিকে গ্রেফতার করেছে কিশোরগঞ্জ জেলা ডিবি পুলিশ",
        //     desc: "কিশোরগঞ্জ পৌর এলাকার উকিলপাড়ায় আপন চাচাতো ভাইকে জবাই করে নৃশংসভাবে হত্যাকারী জুবায়েরকে আটক করেছে জেলা গোয়েন্দা পুলিশ ও জেলা পুলিশের একটি চৌকস দল। মঙ্গলবার (২৭ সেপ্টেম্বর) রাতে নেত্রকোনা জেলার খালিয়াজুড়ি উপজেলা থেকে তাকে গ্রেফতার করা হয়। বুধবার (২৮ সেপ্টেম্বর) জেলা পুলিশ সুপার কার্যলয়ের কনফারেন্স রুমে আয়োজিত প্রেস ব্রিফিংয়ে এসব তথ্য জানায় পুলিশ সুপার মোহাম্মদ রাসেল শেখ পিপিএম বার। পুলিশ সুপার জানান, গত ২১ সেপ্টেম্বর কিশোরগঞ্জ পৌর এলাকার উকিলপাড়ায় অনার্স পড়ুয়া রাহাতকে নৃশংসভাবে জবাই করে হত্যা করে তারই আপন চাচাতো ভাই জুবায়ের। রাহাত ও জুবায়ের এর বাপ চাচারা ৭ ভাই। জুবায়ের এর বাবা সব সময় রাহাত এর বাবার কাছ থেকে বিভিন্ন নির্দেশনা নেন। তা জুবায়ের এর ভাল লাগে না। জুবায়ের চায় কিশোরগঞ্জ শহরে বাড়ি করতে। জুবায়ের এর বাবা মা বড় ভাই অর্থাৎ রাহাত এর বাবার কাছে যায় শহরে বাড়ি করার পরামর্শের জন্য। তখন রাহাত এর বাবা বাড়ি করতে না করে। এ থেকে জুবায়ের এর মনে ক্ষোভ জন্ম নেয়। পরে ঘটনার দিন প্রথমে রাহাতকে ছুরিকাঘাত করা হয় পরে জবাই করে হত্যা নিশ্চিত করে জুবায়ের পালিয়ে যায়। প্রথমে সে ঢাকা তারপর নোয়াখালি পরে খুলনা পরে নেত্রকোনার খালিয়াজুড়ি যায়। সেখান থেকে জেলা পুলিশের একটি চৌকস দল ও জেলা গোয়েন্দা পুলিশ তাকে গ্রেফতার করে। এ ঘটনায় আবির হাসান রাহাতের মা মাহমুদা সুলতানা বাদী হয়ে হত্যাকান্ডের পর দিন অর্থাৎ ২২ সেপ্টেম্বর কিশোরগঞ্জ মডেল থানায় একটি হত্যা মামলা দায়ের করে।মামলায় জুবায়ের সহ চার জনকে আসামী করা হয়। অপর তিন আসামীরা হলেন জুবায়ের এর মা মাহমুদা আক্তার, বাবা শহিদুল হক খন্দকার ও চাচাতো বোন আরিফা সুলতানা। তারা ইতিমধ্যে আটক হয়ে জেল হাজতে আছে। এদিকে বুধবার দুপুরে জুবায়েরকে আদালতে প্রেরণ করেছে পুলিশ।",
        // },
    ])


    // console.log("rcData", rcData);
    useEffect(() => {
        axios.get("/recent-activity").then((response) => {
            setRecentActivityData(response.data);
        }).catch((error) => {
            console.log(error);
        })
    }, [])

    return (
        <div className="pt-1">
            <h6 className="rc__hd__txt">সাম্প্রতিক কার্যক্রম সমূহ</h6>
            <div className="row g-1">
                {
                    // recentActivityData !== undefined && recentActivityData.map((item) => {
                    recentActivityData !== undefined &&
                    recentActivityData.slice(0,6).reverse().map((item) => {
                        return (
                            <div key={item.id} className="col-md-6">
                                <Link to={`/recent-activites-details/${item.id}`} style={{ textDecoration: "none" }} >
                                    <div className="rc__cardp-0">
                                        <div className="card hover-effect">
                                            <div className="row g-0">
                                                <div className="col-4">
                                                    <div className="card__rc__img">
                                                        <img src={`${imgUrl}/${item.image}`} className="img-fluid" alt="..." loading='lazy' />
                                                    </div>
                                                </div>
                                                <div className="col-8">
                                                    <div className="card-body">
                                                        <p className="card__rc__desc">{item.heading}</p>
                                                    </div>
                                                </div>
                                            </div>
                                        </div>
                                    </div>
                                </Link>
                            </div>
                        )
                    })
                }
            </div>

            <div className="row pt-3">
                <div className="col-12">
                    <div className="text-center">
                        <Link to="/recent-activities" className="rc__btn m-0"> আরও সাম্প্রতিক কার্যক্রম সমূহ </Link>
                    </div>
                </div>
            </div>

        </div>
    );
};

export default RecentActivities;